{
  "backend/main.mo": "Main backend actor implementing building management system with user profiles, buildings, invite codes, and role-based access control (binaSahibi, yetkili, sakin). Includes functions for creating buildings, managing invite codes, and user profile operations with authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for redesigning the login page with three simultaneous onboarding cards, implementing flow selection with sessionStorage, and updating post-login routing logic for role-based flows.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files including pages, components, hooks, and utilities for the building management application with Turkish localization.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH-based color system with CSS custom properties for light and dark themes, including sidebar, chart, and semantic color tokens.",
  "frontend/index.html": "HTML entry point with Turkish title 'Bina Yönetim ERP Uygulaması' and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with protected routes (dashboard, home, profile, users) wrapped in Layout, authentication context from useInternetIdentity hook, and loading state handling.",
  "frontend/src/components/BuildingCreateForm.tsx": "Form component for creating new buildings with input validation, loading states, error handling, and success callback using shadcn/ui components and Turkish labels.",
  "frontend/src/components/InviteCodePanel.tsx": "Invite code management panel for building owners with role selection dropdown (yetkili/sakin), code creation button, copy-to-clipboard functionality, and table displaying all created codes with their status and usage information.",
  "frontend/src/components/InviteCodeRegistration.tsx": "A form component for registering with a 16-character alphanumeric invite code, with validation, role-based messaging, and mutation handling via useRegisterWithInviteCode hook.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders navigation, an outlet for child routes, and a footer with branding and caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with desktop and mobile (sheet) menus, displaying links to main pages (Panel, Home, Users, Profile) and a logout button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with an admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, buildings, and invite codes via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, muted, destructive, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying welcome message, user status cards (active status, login info, principal ID), and system information. Shows special first-login banner and uses skeleton loaders during data fetch.",
  "frontend/src/pages/Home.tsx": "Home page with onboarding flows for building owners, authorities, and residents. Displays building information for users with assigned buildings, or shows role-specific onboarding cards with create/invite options for new users.",
  "frontend/src/pages/Login.tsx": "Login page with three user type cards (building owner, authority, resident) that store onboarding flow selection before Internet Identity authentication. Redirects authenticated users to home.",
  "frontend/src/pages/Profile.tsx": "Profile page displaying user information including principal ID, authentication method (Internet Identity), session date, account status, and user role with appropriate badges.",
  "frontend/src/pages/UserDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Users.tsx": "Users list page showing placeholder UI with development notice alert. Includes table structure for displaying all users with principal ID, name, role badges, and first login date (awaiting backend implementation).",
  "frontend/src/utils/roleTranslations.ts": "Utility functions for translating Role enum values to Turkish display names (Bina Sahibi, Yetkili, Sakin) and mapping roles to badge variants (default, secondary, outline).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for a component-based UI system.",
  "project_state.json": "Project state document for a multi-tenant building management ERP system using Internet Identity authentication, defining architectural notes, existing features (authentication, dashboard, user management, tenant/building management), and Turkish-language mobile-responsive requirements."
}