{
  "backend/main.mo": "Main Motoko actor implementing building management system with user profiles, buildings, apartments, announcements, faults, and invite codes. Includes role-based access control (binaSahibi, yetkili, sakin) and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting React Query configuration fixes to prevent infinite query loops and onboarding flow race condition fixes with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including App.tsx, pages, components, hooks, and utilities with descriptions of their functionality and key features.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes with purple/indigo primary colors for building management UI.",
  "frontend/index.html": "HTML entry point for the React application with Turkish title 'Bina Yönetim ERP Uygulaması' and root div mounting point.",
  "frontend/src/App.tsx": "Main React application with TanStack Router, Internet Identity authentication, role-based routing logic, protected routes with loading states, and automatic navigation based on user role and building assignment.",
  "frontend/src/components/AnnouncementCreateForm.tsx": "Form component for creating building announcements with title and description fields, validation, loading states, and success/error toast notifications using shadcn/ui components.",
  "frontend/src/components/AnnouncementsList.tsx": "Displays a list of announcements with loading, error, and empty states, showing title, description, creation date, and creator principal for each announcement.",
  "frontend/src/components/ApartmentCreateForm.tsx": "Form component for creating new apartments with a name/number input field, validation, and submission handling using the useCreateApartment mutation hook.",
  "frontend/src/components/ApartmentsList.tsx": "Displays a table of all apartments in a building with their names and creation dates, including loading, error, and empty states.",
  "frontend/src/components/BuildingCreateForm.tsx": "Form component for creating a new building with name input, validation, error handling, and success callback support.",
  "frontend/src/components/BuildingUsersList.tsx": "Displays a table of all users registered to a building, showing their principal, name, role badge, and assigned apartment ID with loading and error states.",
  "frontend/src/components/DaireGorunumu.tsx": "Grid view component displaying apartment cards with occupancy status, showing whether each apartment is occupied or vacant and the occupant's name if applicable.",
  "frontend/src/components/InviteCodePanel.tsx": "Component for creating and displaying invite codes with role selection, allowing building owners and authorized users to generate role-specific invitation codes with copy functionality and permission-based access control.",
  "frontend/src/components/InviteCodeRegistration.tsx": "React component for registering users with a 16-character alphanumeric invite code. Validates input, displays role-specific messages, and handles registration via mutation hook with success/error toasts.",
  "frontend/src/components/IssueReportForm.tsx": "Form component for reporting building maintenance issues with title, description, and apartment selection. Uses React Query hooks to fetch apartments and submit issue reports with toast notifications.",
  "frontend/src/components/IssuesList.tsx": "Displays a table of open maintenance issues with apartment, reporter, status, and creation date columns. Shows loading skeletons and error states using React Query.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with navigation header, content outlet for nested routes, and footer with copyright and caffeine.ai attribution link.",
  "frontend/src/components/Navigation.tsx": "Role-based navigation component with desktop and mobile menus, filtering menu items by user role (binaSahibi, yetkili, sakin). Includes logout functionality and active route highlighting.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, buildings, apartments, announcements, and maintenance requests. Includes hooks for invite code management and building/apartment CRUD operations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including sidebar, charts, and semantic tokens (primary, destructive, muted, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Announcements.tsx": "Announcements page component that displays building announcements with priority badges, allows authorized users (building owner/authority) to create new announcements, and shows mock data with role-based access control.",
  "frontend/src/pages/BuildingMembers.tsx": "Building members page that displays member statistics and list derived from invite codes, showing member roles, join dates, and counts by role (owner, authority, resident) with role-based visibility.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing welcome message, user status cards (active status, login info, principal ID), and system information with special handling for first-time login users.",
  "frontend/src/pages/Home.tsx": "Home page component managing onboarding flows for different user roles, displaying building overview with statistics (members, invite codes), and conditionally rendering building creation form, invite code panel, or registration form based on user role and building status.",
  "frontend/src/pages/Login.tsx": "Login page with three user type options (building owner, authority, resident) that stores the selected onboarding flow before initiating Internet Identity authentication. Redirects authenticated users to home.",
  "frontend/src/pages/ManagerDashboard.tsx": "Dashboard for authority/manager users displaying building overview, invite code statistics, and issues list. Shows error alerts if profile or building data is missing.",
  "frontend/src/pages/OwnerDashboard.tsx": "Comprehensive dashboard for building owners with statistics, invite code management, building users list, apartment management, announcements, and apartment view components. Includes error handling for missing profile or building data.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying principal ID, authentication method (Internet Identity), session date, account status, and user role with appropriate badges.",
  "frontend/src/pages/ResidentDashboard.tsx": "Dashboard for resident users showing building overview, role information, announcements list, and issue report form. Displays warning if apartment assignment is missing.",
  "frontend/src/pages/UserDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Users.tsx": "Placeholder users list page with table structure for displaying all system users and their roles. Shows alert that feature is under development pending backend implementation.",
  "frontend/src/utils/roleTranslations.ts": "Provides utility functions to translate Role enum values to Turkish display names (Bina Sahibi, Yetkili, Sakin) and map roles to UI badge variants (default, secondary, outline).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for a component library with dark mode support.",
  "project_state.json": "Project state document describing a multi-tenant building management ERP system with Internet Identity authentication, role-based access (Bina Sahibi, Yetkili, Sakin), and known issues including infinite render loops and onboarding flow state management problems."
}