{
  "backend/main.mo": "Main backend actor implementing building management system with user profiles, building creation, invite codes, and role-based access control (binaSahibi, yetkili, sakin) with security fixes preventing multiple building assignments.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including components, pages, hooks, and utilities for the building management application.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes with building management color scheme.",
  "frontend/index.html": "HTML entry point with Turkish title 'Bina Yönetim ERP Uygulaması' and root div mounting the React application.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, Internet Identity authentication, protected routes, and profile setup flow for all pages including dashboard, users, building members, and announcements.",
  "frontend/src/components/BuildingCreateForm.tsx": "Form component for creating new buildings with validation, loading states, error handling, and success callbacks using shadcn/ui components.",
  "frontend/src/components/InviteCodePanel.tsx": "Invite code management panel with role-based code creation (binaSahibi, yetkili, sakin), code listing with status badges, copy functionality, and role-specific permissions enforcement.",
  "frontend/src/components/InviteCodeRegistration.tsx": "A form component for registering with a 16-character alphanumeric invite code, with validation, role-based messaging, and mutation handling via useRegisterWithInviteCode hook.",
  "frontend/src/components/Layout.tsx": "Main layout component that wraps pages with a Navigation component, container styling, and a footer with branding and caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with desktop and mobile (Sheet) menus, displaying menu items (Dashboard, Home, Announcements, Members, Users, Profile) and logout functionality using Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, buildings, invite codes (create, list, register), with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, muted, destructive, charts, sidebar) using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/Announcements.tsx": "Displays and manages building announcements with priority levels. Allows building owners and authorities to create announcements; includes mock data and role-based access control.",
  "frontend/src/pages/BuildingMembers.tsx": "Shows building members list derived from invite codes and displays member statistics by role. Includes role-based visibility and info about backend development status.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing user status, login information, and principal ID. Displays welcome message and first-login indicator with user profile data.",
  "frontend/src/pages/Home.tsx": "Home page with role-based content showing building details, invite code statistics, and onboarding flows. Handles building creation and invite code registration based on user role.",
  "frontend/src/pages/Login.tsx": "Login page with three user type options (building owner, authority, resident) using Internet Identity authentication. Stores onboarding flow selection before login and redirects authenticated users.",
  "frontend/src/pages/Profile.tsx": "Profile page component displaying user information including Principal ID, authentication method (Internet Identity), session date, account status, and user role with loading states and Turkish localization.",
  "frontend/src/pages/UserDetail.tsx": "Empty file placeholder for user detail page functionality.",
  "frontend/src/pages/Users.tsx": "Users list page component with placeholder implementation showing a development notice; displays table structure for user list with Principal ID, name, role, and first login columns in Turkish.",
  "frontend/src/utils/roleTranslations.ts": "Utility functions for translating Role enum values to Turkish display names (Bina Sahibi, Yetkili, Sakin) and mapping roles to badge variants (default, secondary, outline).",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence functions for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter font family, custom animations, and design tokens for sidebar, cards, and charts.",
  "project_state.json": "Project state document defining a multi-tenant building management ERP system with Internet Identity authentication, role-based access (Bina Sahibi, Yetkili, Sakin), phased development strategy, and existing features for authentication, dashboard, navigation, and user management."
}