{
  "backend/main.mo": "Main backend actor implementing building management system with user authentication, role-based access control (binaSahibi/yetkili/sakin), and CRUD operations for buildings, apartments, announcements, invite codes, and issues (ariza). Includes state management with Maps for users, buildings, apartments, announcements, invite codes, and issues with Turkish-language business logic.",
  "backend/migration.mo": "Migration module with a placeholder run function that returns the input actor unchanged, intended for future data migration logic.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for announcements display, issue reporting form, React Query mutation hooks, and ResidentDashboard integration with test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, authentication, role-based dashboards, user management, invite code system, and building management components with Turkish localization.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes with purple/indigo primary colors and comprehensive design tokens.",
  "frontend/index.html": "HTML entry point with Turkish title 'Bina Yönetim ERP Uygulaması' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application with TanStack Router, Internet Identity authentication, role-based routing logic that redirects authenticated users to role-specific dashboards (owner/manager/resident), and protected route handling with loading states.",
  "frontend/src/components/AnnouncementCreateForm.tsx": "Form component for creating building announcements with baslik (title) and aciklama (description) fields, validation, loading states, and success/error toast notifications using React Query mutation.",
  "frontend/src/components/AnnouncementsList.tsx": "Displays a list of announcements with loading, error, and empty states. Shows announcement title, description, creation date, and creator principal in card format.",
  "frontend/src/components/ApartmentCreateForm.tsx": "Form component for creating new apartments with a name/number input field. Handles form submission, validation, and displays success/error toasts.",
  "frontend/src/components/ApartmentsList.tsx": "Displays all apartments in a table format showing apartment name and creation date. Includes loading skeleton, error handling, and empty state.",
  "frontend/src/components/BuildingCreateForm.tsx": "Form component for creating a new building with name input. Handles validation, submission with loading state, and success callback.",
  "frontend/src/components/BuildingUsersList.tsx": "Displays all building users in a table with user principal, name, role badge, and assigned apartment. Includes loading and error states.",
  "frontend/src/components/DaireGorunumu.tsx": "Grid view of apartments showing occupancy status with hover cards. Displays apartment details including creation date and occupant information.",
  "frontend/src/components/InviteCodePanel.tsx": "Manages invite code creation and display based on user role permissions. Shows existing codes with copy functionality and role-based filtering for binaSahibi, yetkili, and sakin roles.",
  "frontend/src/components/InviteCodeRegistration.tsx": "Form component for registering with a 16-character alphanumeric invite code, with validation, role-based messaging, and mutation handling via useRegisterWithInviteCode hook.",
  "frontend/src/components/IssueReportForm.tsx": "Form component for reporting building issues with title, description, and apartment selection, using useReportIssue mutation and useListApartments query.",
  "frontend/src/components/IssuesList.tsx": "Displays a table of open issues with apartment, reporter, status, and creation date columns, fetched via useListIssues hook with loading and error states.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with Navigation, Outlet for nested routes, and footer with copyright and caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "Role-based navigation component with desktop and mobile menus, filtering menu items by user role (binaSahibi, yetkili, sakin) and handling authentication/logout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, buildings, invite codes, apartments, announcements, and maintenance requests. Includes hooks for creating buildings, managing invite codes, and CRUD operations on various entities.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like backgrounds, borders, primary/secondary colors, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Announcements.tsx": "Announcements page component that displays building announcements with priority badges, allows authorized users (building owner/authority) to create new announcements, and shows mock data with form validation.",
  "frontend/src/pages/BuildingMembers.tsx": "Building members page that displays statistics and a list of building members derived from invite codes, showing member roles, join dates, and role-based access controls with loading states.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing welcome message, user status cards (active status, login info, principal ID), and system information with first-login detection and skeleton loading states.",
  "frontend/src/pages/Home.tsx": "Home page component managing onboarding flows for different user roles, displaying building information, statistics (members, invite codes), and conditional rendering based on user role (building owner, authority, resident) with forms for building creation and invite code registration.",
  "frontend/src/pages/Login.tsx": "Login page component that presents three user type options (building owner, authority, resident) and handles Internet Identity authentication while storing the selected onboarding flow in session storage.",
  "frontend/src/pages/ManagerDashboard.tsx": "Dashboard for authority users displaying building overview, invite code statistics, and an issues list with role-based access indicators.",
  "frontend/src/pages/OwnerDashboard.tsx": "Comprehensive dashboard for building owners featuring building overview, statistics cards, invite code management, user list, apartment management, announcements, and apartment view components.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying principal ID, authentication method, session date, account status, and user role information retrieved from Internet Identity and backend queries.",
  "frontend/src/pages/ResidentDashboard.tsx": "Dashboard for resident users showing building information, announcements list, and issue reporting form with role-based UI elements.",
  "frontend/src/pages/UserDetail.tsx": "Empty file placeholder for user detail page functionality.",
  "frontend/src/pages/Users.tsx": "Users list page with placeholder implementation showing a development notice, as the backend getAllUserProfiles endpoint is not yet available.",
  "frontend/src/utils/roleTranslations.ts": "Utility functions to translate Role enum values to Turkish display names and map roles to UI badge variants (default, secondary, outline).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and custom design tokens for a component library.",
  "project_state.json": "Project state document for a multi-tenant building management ERP system using Internet Identity authentication, defining architectural decisions, existing features (authentication, user management, navigation), and phased development strategy."
}