{
  "backend/main.mo": "Main backend actor implementing building management system with user profiles, building creation, invite code system, and role-based access control (binaSahibi, yetkili, sakin) using Motoko Map and AccessControl mixins.",
  "feature_evidence.json": "Feature evidence report documenting five features related to removing invite code registration from login page and moving it to home page onboarding section with building creation functionality.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files including pages, components, hooks, and utilities for the building management application.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes with building management color scheme.",
  "frontend/index.html": "HTML entry point for the React application with Turkish title 'Bina Yönetim ERP Uygulaması' and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with authentication context, protected routes (dashboard, home, profile, users), and loading state handling using Internet Identity hook.",
  "frontend/src/components/BuildingCreateForm.tsx": "Form component for creating new buildings with validation, loading states, error handling, and success callbacks using shadcn/ui components and Turkish labels.",
  "frontend/src/components/InviteCodePanel.tsx": "Invite code management panel for building owners with role selection (yetkili/sakin), code creation, clipboard copy functionality, and table displaying all created codes with their usage status.",
  "frontend/src/components/InviteCodeRegistration.tsx": "Component for registering users via invite codes with 16-character validation, authentication check, and form submission (content truncated in provided file).",
  "frontend/src/components/Layout.tsx": "Main layout component that wraps pages with a navigation header, content area using React Router's Outlet, and a footer with copyright and Caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with desktop and mobile (sheet) menus, displaying nav items (Panel, Ana Sayfa, Kullanıcılar, Profil) with active state highlighting and logout functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for ICP authentication.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, buildings, invite codes, and registration, all using the useActor hook for authenticated canister calls.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, muted, destructive, etc.) and sidebar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying user welcome message, first-login notification, and three cards showing user status, login date, and principal ID with loading skeletons.",
  "frontend/src/pages/Home.tsx": "Home page component that handles building creation, invite code registration, and displays role-based content for users with or without a building association. Includes forms for creating buildings and joining via invite codes with validation.",
  "frontend/src/pages/Login.tsx": "Login page component that provides Internet Identity authentication with a branded interface. Redirects authenticated users to home and displays error messages for failed login attempts.",
  "frontend/src/pages/Profile.tsx": "Profile page displaying user account information including Principal ID, authentication method, role badge, and session details. Shows loading skeletons while fetching user profile data.",
  "frontend/src/pages/UserDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Users.tsx": "Users list page with placeholder implementation showing a table structure for displaying all users with their roles. Currently displays a development notice as the backend endpoint is not yet implemented.",
  "frontend/src/utils/roleTranslations.ts": "Utility functions for translating Role enum values to Turkish display names and mapping roles to badge variants (binaSahibi, yetkili, sakin).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a multi-tenant building management ERP system using Internet Identity authentication. Documents architectural decisions, existing features (authentication, user management, building/invitation system), and development phases with Turkish UI and mobile-responsive design."
}