{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Resident Dashboard features: announcements display and issue reporting",
  "requirements": [
    {
      "id": "REQ-83",
      "summary": "Display comprehensive announcements list in ResidentDashboard with Turkish header 'Duyurular'",
      "acceptanceCriteria": [
        "AnnouncementsList component is integrated into ResidentDashboard",
        "Announcements are displayed in card format with all required fields",
        "Section has clear Turkish header 'Duyurular'",
        "Loading and error states are handled properly",
        "Empty state message is shown when no announcements exist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResidentDashboard.tsx",
          "operation": "modify",
          "description": "Import and integrate the existing AnnouncementsList component with a Turkish section header 'Duyurular'. Wrap the announcements section in a card container with proper spacing. Ensure the section displays title, description, creation date, and creator information for each announcement. The AnnouncementsList component already handles loading, error, and empty states."
        }
      ]
    },
    {
      "id": "REQ-84",
      "summary": "Create issue reporting form component for SAKIN users with Turkish labels and validation",
      "acceptanceCriteria": [
        "Form component accepts title, description, and apartment selection",
        "Apartment dropdown is populated from useListApartments query",
        "Form validation ensures all required fields are filled",
        "Success toast shows 'Arıza başarıyla bildirildi' message",
        "Error toast shows appropriate Turkish error messages",
        "Form resets after successful submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IssueReportForm.tsx",
          "operation": "create",
          "description": "Create a form component that allows residents to report building issues. Include form fields for baslik (title - Input), aciklama (description - Textarea), and daireId (apartment selection - Select dropdown). Use the useListApartments hook to populate the apartment dropdown. Implement form validation to ensure all required fields are filled. On successful submission using the useReportIssue mutation hook, display a success toast with the message 'Arıza başarıyla bildirildi' and reset the form. On error, display a toast with the error message in Turkish. Use shadcn/ui components (Card, CardHeader, CardTitle, CardContent, Label, Input, Textarea, Select, Button) for consistent styling. Include loading state on the submit button while the mutation is pending."
        }
      ]
    },
    {
      "id": "REQ-86",
      "summary": "Create React Query mutation hook for reporting issues with cache invalidation",
      "acceptanceCriteria": [
        "Hook uses useMutation from React Query",
        "Mutation calls backend arizaBildir function with provided parameters",
        "On success, invalidates 'issues' query cache to refresh issue lists",
        "Returns proper loading, error, and success states",
        "Error messages are properly propagated for display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useReportIssue mutation hook that calls the backend arizaBildir function with parameters (baslik: string, aciklama: string, daireId: string). Use useMutation from @tanstack/react-query. On successful mutation, invalidate the 'issues' query key to refresh any issue lists displayed in the application. Return the mutation object with isLoading, isError, error, and mutate properties for use in the IssueReportForm component. Ensure error messages from the backend are properly propagated for display in the UI."
        }
      ]
    },
    {
      "id": "REQ-87",
      "summary": "Integrate IssueReportForm into ResidentDashboard with Turkish header 'Arıza Bildir'",
      "acceptanceCriteria": [
        "IssueReportForm is displayed in ResidentDashboard",
        "Section header 'Arıza Bildir' is clear and prominent",
        "Form is positioned logically after announcements section",
        "Spacing and layout are consistent with other dashboard pages",
        "Form is responsive and works on mobile devices"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResidentDashboard.tsx",
          "operation": "modify",
          "description": "Import and integrate the IssueReportForm component into the ResidentDashboard page. Position the issue reporting section below the announcements section with a clear Turkish header 'Arıza Bildir'. Wrap the form in a card container matching the styling of the announcements section. Ensure consistent spacing between sections using Tailwind spacing utilities (e.g., space-y-6). The layout should be responsive and work well on mobile devices. Follow the same card-based pattern used in OwnerDashboard and ManagerDashboard for visual consistency."
        }
      ]
    },
    {
      "id": "REQ-88",
      "summary": "Update ResidentDashboard layout for clear organization of announcements and issue reporting sections",
      "acceptanceCriteria": [
        "Layout uses consistent card/section containers",
        "Sections are clearly separated with appropriate spacing",
        "Design matches patterns from OwnerDashboard and ManagerDashboard",
        "Layout is responsive and adapts to different screen sizes",
        "All text labels are in Turkish"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResidentDashboard.tsx",
          "operation": "modify",
          "description": "Refactor the ResidentDashboard layout to organize the two feature sections (announcements and issue reporting) in a clear, scannable layout. Use a single-column stacked layout with consistent card containers for each section. Apply proper spacing between sections using Tailwind utilities (e.g., space-y-6 or gap-6). Ensure the design matches the card-based patterns used in OwnerDashboard and ManagerDashboard components. Make the layout responsive using Tailwind responsive utilities so sections adapt appropriately on mobile and tablet devices. Verify all section headers and labels are in Turkish ('Duyurular' for announcements, 'Arıza Bildir' for issue reporting). Each section should be wrapped in a Card component with CardHeader (containing CardTitle) and CardContent for consistent styling."
        }
      ]
    }
  ]
}