{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign login screen with three separate onboarding cards displayed simultaneously",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Redesign Login page to display three distinct onboarding cards simultaneously for Building Owner, Authority (YETKILI), and Resident/Staff (SAKIN) user types with Turkish labels and responsive layout",
      "acceptanceCriteria": [
        "Three separate cards/panels are visible simultaneously on the login screen",
        "Each card is clearly labeled in Turkish indicating its intended user type (Bina Sahibi, Yetkili, Sakin/Personel)",
        "Cards are displayed in a responsive grid layout that works on both desktop and mobile devices",
        "Each card contains its own Internet Identity login button",
        "The layout is horizontally arranged on desktop (3 columns) and stacks vertically on mobile"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Replace the current single-login interface with a three-card layout using a responsive grid (grid-cols-1 md:grid-cols-3). Each card displays: (1) Building Owner card with 'Bina Sahibi' title and 'Bina Oluştur' description, (2) Authority card with 'Yetkili' title and 'Davet Kodu Gir' description for YETKILI role, (3) Resident/Staff card with 'Sakin/Personel' title and 'Davet Kodu Gir' description for SAKIN role. Use shadcn/ui Card components with consistent spacing. Wire the generated icon images from frontend/public/assets/generated/building-owner-icon.dim_128x128.png, frontend/public/assets/generated/authority-icon.dim_128x128.png, and frontend/public/assets/generated/resident-icon.dim_128x128.png as visual identifiers for each card. Each card includes its own Internet Identity login button."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Implement onboarding flow selection mechanism that stores the selected flow type (building-owner, authority, or resident) before initiating authentication",
      "acceptanceCriteria": [
        "Each card's Internet Identity button stores the selected onboarding flow type before authentication",
        "The selected flow persists through the authentication process",
        "After successful authentication, users are redirected to the appropriate post-login experience based on their selected flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Add click handlers to each card's Internet Identity button that store the selected onboarding flow type ('building-owner', 'authority', or 'resident') in sessionStorage before calling the login() function from useInternetIdentity hook. Use the key 'onboardingFlow' for storage. Ensure the flow type persists through the authentication redirect."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Add helper functions getOnboardingFlow() and clearOnboardingFlow() to retrieve and clear the 'onboardingFlow' value from sessionStorage, following the existing pattern of URL parameter management utilities."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Update post-login routing logic to handle three onboarding flows: Building Owner to building creation, Authority to invite code entry with YETKILI context, Resident to invite code entry with SAKIN context",
      "acceptanceCriteria": [
        "Users selecting Building Owner flow are shown the building creation interface after authentication",
        "Users selecting Authority flow are shown invite code entry with YETKILI role context",
        "Users selecting Resident flow are shown invite code entry with SAKIN role context",
        "The routing respects existing authentication and building association checks",
        "Users already associated with a building are redirected to their normal home page regardless of selected flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add logic at component mount to check for stored onboardingFlow in sessionStorage using getOnboardingFlow(). If a flow is present and the user has no building association (kullaniciBinasi is null), display the appropriate UI: 'building-owner' shows BuildingCreateForm, 'authority' or 'resident' shows InviteCodeRegistration with the corresponding role context (YETKILI or SAKIN). Clear the onboardingFlow after reading it using clearOnboardingFlow(). If the user already has a building association, ignore the onboardingFlow and show the normal home page content."
        },
        {
          "path": "frontend/src/components/InviteCodeRegistration.tsx",
          "operation": "modify",
          "description": "Add an optional prop 'suggestedRole' of type Role that pre-populates or locks the role selection based on the onboarding flow context (YETKILI for authority flow, SAKIN for resident flow). Update the component to display role-specific messaging in Turkish when a suggestedRole is provided."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Design each onboarding card with clear visual hierarchy including icon, Turkish title, description, and role-specific Internet Identity button styling",
      "acceptanceCriteria": [
        "Each card includes a visual icon or illustration distinguishing the user type",
        "Card titles clearly identify the user type in Turkish (Bina Sahibi, Yetkili, Sakin/Personel)",
        "Each card includes a 2-3 sentence description in Turkish explaining that user type's role",
        "Internet Identity buttons are visually distinct for each card using color coding or styling",
        "Cards use consistent spacing and styling aligned with existing shadcn/ui component patterns"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Style each onboarding card using shadcn/ui Card, CardHeader, CardTitle, CardDescription, and CardContent components. Include the generated icon images (building-owner-icon.dim_128x128.png, authority-icon.dim_128x128.png, resident-icon.dim_128x128.png) at the top of each card with consistent sizing (w-32 h-32). Add Turkish titles: 'Bina Sahibi' (Building Owner), 'Yetkili' (Authority), 'Sakin/Personel' (Resident/Staff). Include 2-3 sentence Turkish descriptions explaining each role's purpose. Style Internet Identity buttons with role-specific colors using Tailwind classes: blue variant for Building Owner, purple variant for Authority, green variant for Resident. Ensure cards use consistent padding, gap spacing, and follow existing shadcn/ui patterns from the project."
        }
      ]
    }
  ]
}